# Titanic (Classification)

In [8]:
import pandas as pd
import numpy as np
import seaborn as sns
tr1=pd.read_csv("C:\\Users\\HP\\Documents\\titanic\\train.csv")
tr1.drop("Name",axis=1,inplace=True)
tr1.drop("Cabin",axis=1,inplace=True)
tr1.drop("Embarked",axis=1,inplace=True)
tr1.drop("Ticket",axis=1,inplace=True)
tr1.head()

   PassengerId  Survived  Pclass     Sex   Age  SibSp  Parch     Fare
0            1         0       3    male  22.0      1      0   7.2500
1            2         1       1  female  38.0      1      0  71.2833
2            3         1       3  female  26.0      0      0   7.9250
3            4         1       1  female  35.0      1      0  53.1000
4            5         0       3    male  35.0      0      0   8.0500

In [9]:
#Filling Sex as male
tr1['Sex'].fillna('male',inplace=True)
print(tr1['Sex'].value_counts())
tr1.head()

male      577
female    314
Name: Sex, dtype: int64

   PassengerId  Survived  Pclass     Sex   Age  SibSp  Parch     Fare
0            1         0       3    male  22.0      1      0   7.2500
1            2         1       1  female  38.0      1      0  71.2833
2            3         1       3  female  26.0      0      0   7.9250
3            4         1       1  female  35.0      1      0  53.1000
4            5         0       3    male  35.0      0      0   8.0500

In [10]:
from sklearn import preprocessing


l=['Sex']
for i in l:
    label_encoder=preprocessing.LabelEncoder()
    
    label_encoder.fit(tr1[i])
    print(i,label_encoder.classes_)
    
    tr1[i]=label_encoder.transform(tr1[i])
    
tr1.head()

Sex ['female' 'male']

   PassengerId  Survived  Pclass  Sex   Age  SibSp  Parch     Fare
0            1         0       3    1  22.0      1      0   7.2500
1            2         1       1    0  38.0      1      0  71.2833
2            3         1       3    0  26.0      0      0   7.9250
3            4         1       1    0  35.0      1      0  53.1000
4            5         0       3    1  35.0      0      0   8.0500

In [13]:
print(np.mean(tr1['Age']))
print(np.mean(tr1['Fare']))
print(np.mean(tr1['Parch']))
print(np.mean(tr1['Pclass']))
print(np.mean(tr1['Parch']))
print(np.mean(tr1['PassengerId']))

29.699117647058763
32.2042079685746
0.38159371492704824
2.308641975308642
0.38159371492704824
446.0

In [14]:
tr1=tr1.fillna(np.mean(tr1))

In [19]:
#Splitting data
x_tr=tr1[['PassengerId','Pclass','Age','SibSp','Parch','Sex']]
y_tr=tr1[['Survived']]

In [18]:
#Model Fitting
# Creating decision tree classifier object
from sklearn.tree import DecisionTreeClassifier
clf=DecisionTreeClassifier(criterion="entropy", max_depth=3)
clf

DecisionTreeClassifier(class_weight=None, criterion='entropy', max_depth=3,
                       max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort=False,
                       random_state=None, splitter='best')

In [20]:
#train decision tree classifier
clf=clf.fit(x_tr, y_tr)
clf

DecisionTreeClassifier(class_weight=None, criterion='entropy', max_depth=3,
                       max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort=False,
                       random_state=None, splitter='best')

## Importing testing dataset

In [24]:
ts=pd.read_csv("C:\\Users\\HP\\Documents\\titanic\\test.csv")
ts.drop("Name",axis=1,inplace=True)
ts.drop("Cabin",axis=1,inplace=True)
ts.drop("Embarked",axis=1,inplace=True)
ts.drop("Ticket",axis=1,inplace=True)
ts.head()

   PassengerId  Pclass     Sex   Age  SibSp  Parch     Fare
0          892       3    male  34.5      0      0   7.8292
1          893       3  female  47.0      1      0   7.0000
2          894       2    male  62.0      0      0   9.6875
3          895       3    male  27.0      0      0   8.6625
4          896       3  female  22.0      1      1  12.2875

In [ ]:
#Filling Sex as male
ts['Sex'].fillna('male',inplace=True)
print(ts['Sex'].value_counts())
ts.head()

In [25]:
from sklearn import preprocessing

l=['Sex']
for i in l:
    label_encoder=preprocessing.LabelEncoder()
    
    label_encoder.fit(ts[i])
    print(i,label_encoder.classes_)
    
    ts[i]=label_encoder.transform(ts[i])
    
ts.head()

Sex ['female' 'male']

   PassengerId  Pclass  Sex   Age  SibSp  Parch     Fare
0          892       3    1  34.5      0      0   7.8292
1          893       3    0  47.0      1      0   7.0000
2          894       2    1  62.0      0      0   9.6875
3          895       3    1  27.0      0      0   8.6625
4          896       3    0  22.0      1      1  12.2875

In [26]:
print(np.mean(tr1['Age']))
print(np.mean(tr1['Fare']))
print(np.mean(tr1['Parch']))
print(np.mean(tr1['Pclass']))
print(np.mean(tr1['Parch']))
print(np.mean(tr1['PassengerId']))

29.699117647058763
32.2042079685746
0.38159371492704824
2.308641975308642
0.38159371492704824
446.0

In [28]:
ts=ts.fillna(np.mean(ts))

In [29]:
x_ts=ts[['PassengerId','Pclass','Age','SibSp','Parch','Sex']]

In [32]:
#Predicting response
y_pred=clf.predict(x_ts)
#print(y_pred)
y_pred.shape

(418,)

In [39]:
#from sklearn.metrics import confusion_matrix
#confMat=confusion_matrix(y_ts,y_pred)
#confMat

## Generating and submitting file

In [44]:

ts1=pd.read_csv("C:\\Users\\HP\\Documents\\titanic\\test.csv")
PassengerId=pd.DataFrame(ts1['PassengerId'])
print(PassengerId.shape)
Survived=pd.DataFrame(y_pred,columns=['Survived'])
y_pred.shape

(418, 1)

(418,)

In [45]:
submission=pd.concat([PassengerId,Survived],axis=1)
submission.head()

   PassengerId  Survived
0          892         0
1          893         0
2          894         0
3          895         0
4          896         1

In [46]:
submission.to_csv('submission_titanic.csv')